grblHAL/ESP32/main/driver.c
        hal.spindle.set_state = spindleSetStateVariable;

        if(ledTimerConfig.freq_hz != (uint32_t)settings.spindle.pwm_freq) {
            ledTimerConfig.freq_hz = (uint32_t)settings.spindle.pwm_freq;
            if(ledTimerConfig.freq_hz <= 100) {
                if(ledTimerConfig.duty_resolution != LEDC_TIMER_16_BIT) {
                    ledTimerConfig.duty_resolution = LEDC_TIMER_16_BIT;
                    ledc_timer_config(&ledTimerConfig);
                }
            } else if(ledTimerConfig.duty_resolution != LEDC_TIMER_10_BIT) {
                ledTimerConfig.duty_resolution = LEDC_TIMER_10_BIT;
                ledc_timer_config(&ledTimerConfig);
            }
        }

        pwm_max_value = (1UL << ledTimerConfig.duty_resolution) - 1;

        spindle_pwm.period = (uint32_t)(80000000UL / settings.spindle.pwm_freq);
        if(settings.spindle.pwm_off_value == 0.0f)
            spindle_pwm.off_value = settings.spindle.invert.pwm ? pwm_max_value : 0;
        else {
            spindle_pwm.off_value = (uint32_t)(pwm_max_value * settings.spindle.pwm_off_value / 100.0f);
            if(settings.spindle.invert.pwm)
                spindle_pwm.off_value = pwm_max_value - spindle_pwm.off_value;
        }
        spindle_pwm.min_value = (uint32_t)(pwm_max_value * settings.spindle.pwm_min_value / 100.0f);
        spindle_pwm.max_value = (uint32_t)(pwm_max_value * settings.spindle.pwm_max_value / 100.0f) + (settings.spindle.invert.pwm ? -1 : 1);
        spindle_pwm.pwm_gradient = (float)(spindle_pwm.max_value - spindle_pwm.min_value) / (settings.spindle.rpm_max - settings.spindle.rpm_min);
        spindle_pwm.always_on = settings.spindle.pwm_off_value != 0.0f;

        ledc_set_freq(ledTimerConfig.speed_mode, ledTimerConfig.timer_num, ledTimerConfig.freq_hz);

    } else {
        if(pwmEnabled)
            hal.spindle.set_state((spindle_state_t){0}, 0.0f);
        hal.spindle.set_state = spindleSetState;
    }

    spindle_update_caps(hal.spindle.cap.variable ? &spindle_pwm : NULL);

    return true;
}

#endif // SPINDLEPWMPIN

// Returns spindle state in a spindle_state_t variable
static spindle_state_t spindleGetState (void)
{
    spindle_state_t state = {0};

#if IOEXPAND_ENABLE // TODO: read from expander?
    state.on = iopins.spindle_on;
    state.ccw = hal.spindle.cap.direction && iopins.spindle_dir;
#else
 #if defined(SPINDLE_ENABLE_PIN)
  #if I2S_SPINDLE
    state.on = DIGITAL_IN(SPINDLE_ENABLE_PIN) != 0;
  #else
    state.on = gpio_get_level(SPINDLE_ENABLE_PIN) != 0;
  #endif
 #endif
 #if defined(SPINDLE_DIRECTION_PIN)
  #if I2S_SPINDLE
    state.ccw = DIGITAL_IN(SPINDLE_DIRECTION_PIN) != 0;
  #else
    state.ccw = gpio_get_level(SPINDLE_DIRECTION_PIN) != 0;
  #endif
 #endif
#endif
    state.value ^= settings.spindle.invert.mask;
#ifdef SPINDLEPWMPIN
    state.on |= pwmEnabled;
  #if PWM_RAMPED
    state.at_speed = ledc_get_duty(ledConfig.speed_mode, ledConfig.channel) == pwm_ramp.pwm_target;
  #endif
#endif

    return state;
}

#endif // DRIVER_SPINDLE

// Start/stop coolant (and mist if enabled)
IRAM_ATTR static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;
#if IOEXPAND_ENABLE
    iopins.flood_on = mode.flood;
    iopins.mist_on = mode.mist;
    ioexpand_out(iopins);
#else
 #ifdef COOLANT_FLOOD_PIN
  #if I2S_COOLANT
    DIGITAL_OUT(COOLANT_FLOOD_PIN, mode.flood ? 1 : 0);
  #else
    gpio_set_level(COOLANT_FLOOD_PIN, mode.flood ? 1 : 0);
  #endif
 #endif
 #ifdef COOLANT_MIST_PIN
  #if I2S_COOLANT
    DIGITAL_OUT(COOLANT_MIST_PIN, mode.mist ? 1 : 0);
  #else
    gpio_set_level(COOLANT_MIST_PIN, mode.mist ? 1 : 0);
  #endif
 #endif
#endif
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

#if IOEXPAND_ENABLE // TODO: read from expander?
    state.flood = iopins.flood_on;
    state.mist = iopins.mist_on;
#else
 #ifdef COOLANT_FLOOD_PIN
  #if I2S_COOLANT
    DIGITAL_IN(COOLANT_FLOOD_PIN);
  #else
    state.flood = gpio_get_level(COOLANT_FLOOD_PIN);
  #endif
 #endif
 #ifdef COOLANT_MIST_PIN
  #if I2S_COOLANT
    state.mist  = DIGITAL_IN(COOLANT_MIST_PIN);
  #else
    state.mist  = gpio_get_level(COOLANT_MIST_PIN);
  #endif
 #endif
#endif

    state.value ^= settings.coolant_invert.mask;

    return state;
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
IRAM_ATTR static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    portENTER_CRITICAL(&mux);
    *ptr |= bits;
    portEXIT_CRITICAL(&mux);
}

IRAM_ATTR static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    portEXIT_CRITICAL(&mux);
    return prev;
}

IRAM_ATTR static uint_fast16_t valueSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t value)
{
    portENTER_CRITICAL(&mux);
    uint_fast16_t prev = *ptr;
    *ptr = value;
    portEXIT_CRITICAL(&mux);
    return prev;
}

static void enable_irq (void)
{
    portEXIT_CRITICAL(&mux);
}

static void disable_irq (void)
{
    portENTER_CRITICAL(&mux);
}

#if MPG_MODE_ENABLE

static void modeChange(sys_state_t state)
{
    stream_mpg_enable(!gpio_get_level(MPG_ENABLE_PIN));
}

static void modeEnable (sys_state_t state)
{
    if(sys.mpg_mode == gpio_get_level(MPG_ENABLE_PIN))
        stream_mpg_enable(true);
}

#endif

void debounceTimerCallback (TimerHandle_t xTimer)
{
    uint32_t grp = 0, i = sizeof(inputpin) / sizeof(input_signal_t);
    do {
        i--;
        if(inputpin[i].debounce && inputpin[i].active) {
            inputpin[i].active = false; //gpio_get_level(inputpin[i].pin) == (inputpin[i].invert ? 0 : 1);
            grp |= inputpin[i].group;
        }
    } while(i);

    if(grp & PinGroup_Limit) {
        portENTER_CRITICAL(&debounce_mux);
        hal.limits.interrupt_callback(limitsGetState());
        portEXIT_CRITICAL(&debounce_mux);
    }

    if(grp & PinGroup_Control) {
        portENTER_CRITICAL(&debounce_mux);
        hal.control.interrupt_callback(systemGetState());
        portEXIT_CRITICAL(&debounce_mux);
    }
}

gpio_int_type_t map_intr_type (pin_irq_mode_t mode)
{
    switch(mode) {
    case IRQ_Mode_Rising:
        return GPIO_INTR_POSEDGE;
        break;
    case IRQ_Mode_Falling:
        return GPIO_INTR_NEGEDGE;
        break;
    case IRQ_Mode_Change:
        return GPIO_INTR_ANYEDGE;
        break;
    case IRQ_Mode_Edges:
        return GPIO_INTR_DISABLE;
        break;
    case IRQ_Mode_High:
        return GPIO_INTR_HIGH_LEVEL;
        break;
    case IRQ_Mode_Low:
        return GPIO_INTR_LOW_LEVEL;
        break;
    default:
        break;
    }

    return GPIO_INTR_DISABLE;
}

// Configures perhipherals when settings are initialized or changed
static void settings_changed (settings_t *settings)
{
    if(IOInitDone) {

#ifdef SPINDLEPWMPIN
        if(hal.spindle.config == spindleConfig)
            spindleConfig();
#endif

#if BLUETOOTH_ENABLE
        static bool bluetooth_ok = false;
        if(!bluetooth_ok)
            bluetooth_ok = bluetooth_start();
        // else report error?
#endif

#if WIFI_ENABLE

        static bool wifi_ok = false;

