grblHAL/ESP32/main/driver.c
#if PWM_RAMPED
    ledc_fade_func_install(ESP_INTR_FLAG_IRAM);
#endif
    ledConfig.speed_mode = ledTimerConfig.speed_mode;
    ledc_timer_config(&ledTimerConfig);
    ledc_channel_config(&ledConfig);

    static const periph_pin_t pwm = {
        .function = Output_SpindlePWM,
        .group = PinGroup_SpindlePWM,
        .pin = SPINDLEPWMPIN,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    hal.periph_port.register_pin(&pwm);

    /**/

#endif // DRIVER_SPINDLE

#if SDCARD_ENABLE

    sdcard_events_t *card = sdcard_init();
    card->on_mount = sdcard_mount;
    card->on_unmount = sdcard_unmount;

    sdcard_mount(NULL);

    static const periph_pin_t sck = {
        .function = Output_SCK,
        .group = PinGroup_SPI,
        .pin = PIN_NUM_CLK,
        .mode = { .mask = PINMODE_OUTPUT }
    };

    static const periph_pin_t sdo = {
        .function = Output_MOSI,
        .group = PinGroup_SPI,
        .pin = PIN_NUM_MOSI,
        .mode = { .mask = PINMODE_NONE }
    };

    static const periph_pin_t sdi = {
        .function = Input_MISO,
        .group = PinGroup_SPI,
        .pin = PIN_NUM_MISO,
        .mode = { .mask = PINMODE_NONE }
    };

    hal.periph_port.register_pin(&sck);
    hal.periph_port.register_pin(&sdo);
    hal.periph_port.register_pin(&sdi);

#endif

#if IOEXPAND_ENABLE
    ioexpand_init();
#endif

  // Set defaults

    IOInitDone = settings->version == 21;

    hal.settings_changed(settings);
    hal.stepper.go_idle(true);

#if ETHERNET_ENABLE
    enet_start();
#endif

    return IOInitDone;
}

static bool set_rtc_time (struct tm *time)
{
    const struct timezone tz = {
        .tz_minuteswest = 0,
        .tz_dsttime = 0
    };
    struct timeval t;
    t.tv_sec = mktime(time);
    t.tv_usec = 0;

    return (rtc_started = settimeofday(&t, &tz) == 0);
}

static bool get_rtc_time (struct tm *dt)
{
    bool ok = false;

    if(rtc_started) {
        time_t now;
        if((ok = time(&now) != (time_t)-1))
            localtime_r(&now, dt);
    }

    return ok;
}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Enable EEPROM and serial port here for Grbl to be able to configure itself and report any errors

    rtc_cpu_freq_config_t cpu;
    rtc_clk_cpu_freq_get_config(&cpu);

    hal.info = "ESP32";
    hal.driver_version = "221205";
    hal.driver_url = GRBL_URL "/ESP32";
#ifdef BOARD_NAME
    hal.board = BOARD_NAME;
#endif
#ifdef BOARD_URL
    hal.board_url = BOARD_URL;
#endif

    hal.driver_options = IDF_VER;
    hal.driver_setup = driver_setup;
    hal.f_mcu = cpu.freq_mhz;
    hal.f_step_timer = rtc_clk_apb_freq_get() / STEPPER_DRIVER_PRESCALER; // 20 MHz
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.get_free_mem = esp_get_free_heap_size;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

#if !USE_I2S_OUT
    hal.stepper.wake_up = stepperWakeUp;
    hal.stepper.go_idle = stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = stepperCyclesPerTick;
    hal.stepper.pulse_start = stepperPulseStart;
#else
    hal.driver_reset = I2S_reset;
    hal.stepper.wake_up = I2S_stepperWakeUp;
    hal.stepper.go_idle = I2S_stepperGoIdle;
    hal.stepper.enable = stepperEnable;
    hal.stepper.cycles_per_tick = I2S_stepperCyclesPerTick;
    hal.stepper.pulse_start = I2S_stepperPulseStart;
    i2s_out_init();
    i2s_out_set_pulse_callback(hal.stepper.interrupt_callback);
#endif
    hal.stepper.motor_iterator = motor_iterator;
#ifdef GANGING_ENABLED
    hal.stepper.get_ganged = getGangedAxes;
#endif
#ifdef SQUARING_ENABLED
    hal.stepper.disable_motors = StepperDisableMotors;
#endif

    hal.limits.enable = limitsEnable;
    hal.limits.get_state = limitsGetState;

    hal.coolant.set_state = coolantSetState;
    hal.coolant.get_state = coolantGetState;

#ifdef PROBE_PIN
    hal.probe.get_state = probeGetState;
    hal.probe.configure = probeConfigure;
#endif

    hal.control.get_state = systemGetState;

    hal.reboot = esp_restart;
    hal.irq_enable = enable_irq;
    hal.irq_disable = disable_irq;
#if I2C_STROBE_ENABLE
    hal.irq_claim = irq_claim;
#endif
    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;
    hal.get_elapsed_ticks = xTaskGetTickCountFromISR;
    hal.enumerate_pins = enumeratePins;
    hal.periph_port.register_pin = registerPeriphPin;
    hal.periph_port.set_pin_description = setPeriphPinDescription;

    hal.rtc.get_datetime = get_rtc_time;
    hal.rtc.set_datetime = set_rtc_time;

    stream_connect(serialInit(BAUD_RATE));

#if I2C_ENABLE
    I2CInit();
#endif

#if EEPROM_ENABLE
    i2c_eeprom_init();
#else
    if(nvsInit()) {
        hal.nvs.type = NVS_Flash;
        hal.nvs.memcpy_from_flash = nvsRead;
        hal.nvs.memcpy_to_flash = nvsWrite;
    } else
        hal.nvs.type = NVS_None;
#endif

#ifdef DEBUGOUT
    hal.debug_out = debug_out;
#endif

#ifdef DRIVER_SPINDLE

    static const spindle_ptrs_t spindle = {
 #ifdef SPINDLEPWMPIN
        .type = SpindleType_PWM,
        .cap.variable = On,
        .cap.laser = On,
        .cap.pwm_invert = On,
  #if PWM_RAMPED
        .cap.at_speed = On;
  #endif
        .config = spindleConfig,
        .get_pwm = spindleGetPWM,
        .update_pwm = spindle_set_speed,
  #if PPI_ENABLE
        .pulse_on = spindlePulseOn,
  #endif
 #else
       .type = SpindleType_Basic,
 #endif
 #if IOEXPAND_ENABLE || defined(SPINDLE_DIRECTION_PIN)
        .cap.direction = On,
 #endif
        .set_state = spindleSetState,
        .get_state = spindleGetState,
        .esp32_off = spindleOff
    };

 #ifdef SPINDLEPWMPIN
    spindle_register(&spindle, "PWM");
 #else
    spindle_register(&spindle, "Basic");
 #endif

#endif // DRIVER_SPINDLE

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

  #if IOEXPAND_ENABLE || defined(COOLANT_MIST_PIN)
    hal.driver_cap.mist_control = On;
  #endif
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#ifdef SAFETY_DOOR_PIN
    hal.signals_cap.safety_door_ajar = On;
#endif
#if MPG_MODE_ENABLE
    hal.driver_cap.mpg_mode = stream_mpg_register(serial2Init(115200), true, NULL);
#endif

#ifdef HAS_IOPORTS

    uint32_t i;
    static pin_group_pins_t aux_inputs = {0}, aux_outputs = {0};
    input_signal_t *input;
    output_signal_t *output;

    for(i = 0 ; i < sizeof(inputpin) / sizeof(input_signal_t); i++) {
        input = &inputpin[i];
        if(input->group == PinGroup_AuxInput) {
            if(aux_inputs.pins.inputs == NULL)
                aux_inputs.pins.inputs = input;
            input->cap.pull_mode = PullMode_UpDown;
            input->cap.irq_mode = IRQ_Mode_Edges;
            aux_inputs.n_pins++;
        }
    }

    for(i = 0 ; i < sizeof(outputpin) / sizeof(output_signal_t); i++) {
        output = &outputpin[i];
        if(output->group == PinGroup_AuxOutput) {
            if(aux_outputs.pins.outputs == NULL)
                aux_outputs.pins.outputs = output;
            aux_outputs.n_pins++;
        }
    }

    ioports_init(&aux_inputs, &aux_outputs);

#endif

    serialRegisterStreams();

#ifdef HAS_BOARD_INIT
    board_init();
#endif

#if WIFI_ENABLE
    wifi_init();
#endif

#if ETHERNET_ENABLE
    enet_init();
#endif

#if BLUETOOTH_ENABLE
    bluetooth_init();
#endif

#if LITTLEFS_ENABLE
    fs_littlefs_mount("/littlefs", esp32_littlefs_hal());
#endif

#include "grbl/plugins_init.h"

