grblHAL/ESP32/main/driver.c
    // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 10;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
    TIMERG0.int_clr_timers.t0 = 1;
    TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;
    
    hal.stepper.interrupt_callback();
}

#if ETHERNET_ENABLE

IRAM_ATTR static void gpio_limit_isr (void *signal)
{
    if(((input_signal_t *)signal)->debounce) {
        ((input_signal_t *)signal)->active = true;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
    } else
        hal.limits.interrupt_callback(limitsGetState());
}

IRAM_ATTR static void gpio_control_isr (void *signal)
{
    if(((input_signal_t *)signal)->debounce) {
        ((input_signal_t *)signal)->active = true;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
    } else
        hal.control.interrupt_callback(systemGetState());
}

IRAM_ATTR static void gpio_aux_isr (void *signal)
{
#ifdef HAS_IOPORTS
    ioports_event((input_signal_t *)signal);
#endif
}

#if MPG_MODE_ENABLE && ETHERNET_ENABLE

IRAM_ATTR static void gpio_mpg_isr (void *signal)
{
    static bool mpg_mutex = false;

    if(!mpg_mutex) {
        mpg_mutex = true;
        protocol_enqueue_rt_command(modeChange);
        mpg_mutex = false;
    }
}

#endif

#if I2C_STROBE_ENABLE
IRAM_ATTR static void gpio_i2c_strobe_isr (void *signal)
{
    if(i2c_strobe.callback)
        i2c_strobe.callback(0, gpio_get_level(I2C_STROBE_PIN));
}
#endif

#else

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
    bool debounce = false;
    uint32_t grp = 0, intr_status[2];
    intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);          // get interrupt status for GPIO0-31
    intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);         // get interrupt status for GPIO32-39
    SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
    SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]); // clear intr for gpio32-39

    uint32_t i = sizeof(inputpin) / sizeof(input_signal_t);
    do {
        i--;
        if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
#ifdef HAS_IOPORTS
            if(inputpin[i].group & PinGroup_AuxInput)
                ioports_event(&inputpin[i]);
            else {
#endif
            inputpin[i].active = true;
            if(inputpin[i].debounce)
                debounce = true;
            else
                grp |= inputpin[i].group;
#ifdef HAS_IOPORTS
            }
#endif
        }
    } while(i);

    if(debounce) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
    }

    if(grp & PinGroup_Limit)
        hal.limits.interrupt_callback(limitsGetState());

    if(grp & PinGroup_Control)
        hal.control.interrupt_callback(systemGetState());

#if MPG_MODE_ENABLE

    static bool mpg_mutex = false;

    if((grp & PinGroup_MPG) && !mpg_mutex) {
        mpg_mutex = true;
        protocol_enqueue_rt_command(modeChange);
        mpg_mutex = false;
    }
#endif

#if I2C_STROBE_ENABLE
    if((grp & PinGroup_Keypad) && i2c_strobe.callback)
        i2c_strobe.callback(0, gpio_get_level(I2C_STROBE_PIN));
#endif
}

#endif
